cout<<"请您本月的收入总额（元）：";

if(YSR==0)
{
    cout<<"\n检测到您未进行过数据输入，现进行计算您的月预扣纳税方案";

    #include "YUKOU.cpp"

    cout<<"本月收入总额："<<YSR<<"元\n专项扣除费用总额："<<ZXKC;
    cout<<"元\n您本月缴纳个人所得税："<<NS<<"元\n您的扣除和税后收入："<<YSHSR<<"元";
}

cout<<"\n\n请输入当月月份：";
cin>>YF;
cout<<"计算截止当月累计预扣税额！"<<"\n......\n";

for (int i=1;i<=YF;i++)
{
    double LYNSE;
    LYNSE=YNSE*i;    
    if(LYNSE<0)
    {
        LYNSE=0;
    }
    cout<<"\n"<<i<<"月份累计预扣预缴应纳税所得额为："<<LYNSE<<"   预扣税"<<NS<<"\n------------------------";
}

cout<<"\n您"<<YF<<"月份缴纳个人所得税 "<<NS<<"元"<<"\n税后收入是 "<<YSHSR<<"元"<<"\n\n感谢依法纳税，谢谢使用！";

